Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_AUTO_EDIT_GAP:      edit_auto_gap_s++; break;
        case UI_AUTO_EDIT_MAXRUN:   edit_auto_maxrun_min++; break;
        case UI_AUTO_EDIT_RETRY:    edit_auto_retry++; break;

        case UI_TWIST_EDIT_ON:
            if (++edit_twist_on_s > 999) edit_twist_on_s = 0;
            break;

        case UI_TWIST_EDIT_OFF:
            if (++edit_twist_off_s > 999) edit_twist_off_s = 0;
            break;

        case UI_TWIST_EDIT_ON_H:
            edit_twist_on_hh = (edit_twist_on_hh + 1) % 24; break;

        case UI_TWIST_EDIT_ON_M:
            edit_twist_on_mm = (edit_twist_on_mm + 1) % 60; break;

        case UI_TWIST_EDIT_OFF_H:
            edit_twist_off_hh = (edit_twist_off_hh + 1) % 24; break;

        case UI_TWIST_EDIT_OFF_M:
            edit_twist_off_mm = (edit_twist_off_mm + 1) % 60; break;

        case UI_COUNTDOWN_EDIT_MIN:
            if (++edit_countdown_min > 999) edit_countdown_min = 1;
            break;

        default:
            break;
    }
}

static void decrease_edit_value(void){
    switch(ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:
            edit_timer_on_h = (edit_timer_on_h==0)?23:edit_timer_on_h-1; break;

        case UI_TIMER_EDIT_SLOT_ON_M:
            edit_timer_on_m = (edit_timer_on_m==0)?59:edit_timer_on_m-1; break;

        case UI_TIMER_EDIT_SLOT_OFF_H:
            edit_timer_off_h = (edit_timer_off_h==0)?23:edit_timer_off_h-1; break;

        case UI_TIMER_EDIT_SLOT_OFF_M:
            edit_timer_off_m = (edit_timer_off_m==0)?59:edit_timer_off_m-1; break;

        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s>0) edit_auto_gap_s--;
            break;

        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min>0) edit_auto_maxrun_min--;
            break;

        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry>0) edit_auto_retry--;
            break;

        case UI_TWIST_EDIT_ON:
            edit_twist_on_s = (edit_twist_on_s==0)?999:edit_twist_on_s-1;
            break;

        case UI_TWIST_EDIT_OFF:
            edit_twist_off_s = (edit_twist_off_s==0)?999:edit_twist_off_s-1;
            break;

        case UI_TWIST_EDIT_ON_H:
            edit_twist_on_hh = (edit_twist_on_hh==0)?23:edit_twist_on_hh-1;
            break;

        case UI_TWIST_EDIT_ON_M:
            edit_twist_on_mm = (edit_twist_on_mm==0)?59:edit_twist_on_mm-1;
            break;

        case UI_TWIST_EDIT_OFF_H:
            edit_twist_off_hh = (edit_twist_off_hh==0)?23:edit_twist_off_hh-1;
            break;

        case UI_TWIST_EDIT_OFF_M:
            edit_twist_off_mm = (edit_twist_off_mm==0)?59:edit_twist_off_mm-1;
            break;

        case UI_COUNTDOWN_EDIT_MIN:
            edit_countdown_min = (edit_countdown_min==1)?999:edit_countdown_min-1;
            break;

        default:
            break;
    }
}

/***************************************************************
 *  SCREEN.C — PART 3 OF 3
 *  Button Handling + Mode Logic + LCD Update Engine
 ***************************************************************/

/* ================================================================
   BUTTON DECODER (robust long-press handling)
   ================================================================ */

static UiButton decode_button_press(void){
    bool sw1 = Switch_IsPressed(0);
    bool sw2 = Switch_IsPressed(1);
    bool sw3 = Switch_IsPressed(2);
    bool sw4 = Switch_IsPressed(3);

    bool sw[4] = {sw1, sw2, sw3, sw4};
    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;

    for (int i = 0; i < 4; i++)
    {
        /* Start press */
        if (sw[i] && sw_press_start[i] == 0){
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }

        /* Released → short press */
        else if (!sw[i] && sw_press_start[i] != 0){
            if (!sw_long_issued[i]){
                switch(i){
                    case 0: out = BTN_RESET;  break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP;     break;
                    case 3: out = BTN_DOWN;   break;
                }
            }
            sw_press_start[i] = 0;
            sw_long_issued[i] = false;
        }

        /* Held long enough → long press */
        else if (sw[i] && !sw_long_issued[i]){
            if (now - sw_press_start[i] >= LONG_PRESS_MS){
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG;  break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG;     break;
                    case 3: out = BTN_DOWN_LONG;   break;
                }
            }
        }
    }

    return out;
}

/* ================================================================
   MENU ENTER HANDLER
   ================================================================ */

static void goto_menu_top(void){
    menu_idx = 0;
    menu_view_top = 0;
}

/* ================================================================
   MENU ENTER HANDLER (FINAL VERSION)
   ================================================================ */
/* ================================================================
   MENU ENTER HANDLER (FINAL — BUG FREE)
   ================================================================ */
static void menu_select(void)
{
    refreshInactivityTimer();

    switch (ui)
    {
        /* ==========================
           WELCOME → DASHBOARD
           ========================== */
        case UI_WELCOME:
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* ==========================
           DASHBOARD → MAIN MENU
           ========================== */
        case UI_DASH:
            ui = UI_MENU;
            goto_menu_top();
            screenNeedsRefresh = true;
            return;

        /* ==========================
           MAIN MENU
           ========================== */
        case UI_MENU:
            switch(menu_idx)
            {
                case 0: ui = UI_TIMER; currentSlot = 0; break;
                case 1: ui = UI_AUTO_MENU; break;
                case 2: ui = UI_TWIST; break;
//                case 3: ui = UI_SETTINGS; break;
                case 3: ui = UI_DASH; break;  /* Back */
            }
            screenNeedsRefresh = true;
            return;

