Amiya200/stm32_water_tank/Core/Src/screen.c
        /* ==========================
           TIMER EDIT FLOW
           ========================== */
        case UI_TIMER:
            ui = UI_TIMER_EDIT_SLOT_ON_H; screenNeedsRefresh = true; return;
        case UI_TIMER_EDIT_SLOT_ON_H:
            ui = UI_TIMER_EDIT_SLOT_ON_M; screenNeedsRefresh = true; return;
        case UI_TIMER_EDIT_SLOT_ON_M:
            ui = UI_TIMER_EDIT_SLOT_OFF_H; screenNeedsRefresh = true; return;
        case UI_TIMER_EDIT_SLOT_OFF_H:
            ui = UI_TIMER_EDIT_SLOT_OFF_M; screenNeedsRefresh = true; return;
        case UI_TIMER_EDIT_SLOT_OFF_M:
            apply_timer_settings();
            ui = UI_TIMER;
            screenNeedsRefresh = true;
            return;

        /* ==========================
           AUTO SETTINGS
           ========================== */
        case UI_AUTO_MENU:
            ui = UI_AUTO_EDIT_GAP; screenNeedsRefresh = true; return;
        case UI_AUTO_EDIT_GAP:
            ui = UI_AUTO_EDIT_MAXRUN; screenNeedsRefresh = true; return;
        case UI_AUTO_EDIT_MAXRUN:
            ui = UI_AUTO_EDIT_RETRY; screenNeedsRefresh = true; return;
        case UI_AUTO_EDIT_RETRY:
            apply_auto_settings();
            ui = UI_AUTO_MENU;
            screenNeedsRefresh = true;
            return;

        /* ==========================
           TWIST SETTINGS
           ========================== */
        case UI_TWIST:
            ui = UI_TWIST_EDIT_ON; screenNeedsRefresh = true; return;
        case UI_TWIST_EDIT_ON:
            ui = UI_TWIST_EDIT_OFF; screenNeedsRefresh = true; return;
        case UI_TWIST_EDIT_OFF:
            ui = UI_TWIST_EDIT_ON_H; screenNeedsRefresh = true; return;
        case UI_TWIST_EDIT_ON_H:
            ui = UI_TWIST_EDIT_ON_M; screenNeedsRefresh = true; return;
        case UI_TWIST_EDIT_ON_M:
            ui = UI_TWIST_EDIT_OFF_H; screenNeedsRefresh = true; return;
        case UI_TWIST_EDIT_OFF_H:
            ui = UI_TWIST_EDIT_OFF_M; screenNeedsRefresh = true; return;
        case UI_TWIST_EDIT_OFF_M:
            apply_twist_settings();
            ui = UI_TWIST;
            screenNeedsRefresh = true;
            return;

        /* ==========================
           COUNTDOWN SETTINGS
           ========================== */
        case UI_COUNTDOWN:
            if (countdownActive)
                ModelHandle_StopCountdown();
            else {
                apply_countdown_settings();
                ModelHandle_StartCountdown(edit_countdown_min * 60UL);
            }
            screenNeedsRefresh = true;
            return;

        case UI_COUNTDOWN_EDIT_MIN:
            apply_countdown_settings();
            ui = UI_COUNTDOWN;
            screenNeedsRefresh = true;
            return;

        default:
            return;
    }
}

/* ================================================================
   HANDLE BUTTONS (MAIN FLOW)
   ================================================================ */
void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    if (b == BTN_NONE) return;

    refreshInactivityTimer();

    bool insideMenu =
        (ui == UI_MENU ||
         ui == UI_TIMER ||
         ui == UI_TIMER_EDIT_SLOT_ON_H ||
         ui == UI_TIMER_EDIT_SLOT_ON_M ||
         ui == UI_TIMER_EDIT_SLOT_OFF_H ||
         ui == UI_TIMER_EDIT_SLOT_OFF_M ||
         ui == UI_AUTO_MENU ||
         ui == UI_AUTO_EDIT_GAP ||
         ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY ||
         ui == UI_TWIST ||
         ui == UI_TWIST_EDIT_ON ||
         ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H ||
         ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H ||
         ui == UI_TWIST_EDIT_OFF_M ||
         ui == UI_COUNTDOWN_EDIT_MIN);


    /* ============================================================
       OUTSIDE MENU — MAIN USER ACTIONS
       ============================================================ */
    if (!insideMenu)
    {
        switch (b)
        {
            /* ----------------------------------------------------
               SW1 SHORT → Restart pump immediately
               ---------------------------------------------------- */
            case BTN_RESET:
                ModelHandle_SetMotor(true);
                ui = UI_DASH;
                screenNeedsRefresh = true;
                return;

            /* ----------------------------------------------------
               SW1 LONG → Toggle Manual Mode
               ---------------------------------------------------- */
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                ui = manualActive ? UI_MANUAL : UI_DASH;
                screenNeedsRefresh = true;
                return;

            /* ----------------------------------------------------
               SW2 SHORT → AUTO toggle
               ---------------------------------------------------- */
            case BTN_SELECT:
                if (autoActive)
                    ModelHandle_StopAllModesAndMotor();
                else
                    autoActive = true;

                ui = UI_DASH;
                screenNeedsRefresh = true;
                return;

            /* ----------------------------------------------------
               SW2 LONG → Enter Main Menu
               ---------------------------------------------------- */
            case BTN_SELECT_LONG:
                ui = UI_MENU;
                goto_menu_top();
                screenNeedsRefresh = true;
                return;

            /* ----------------------------------------------------
               SW3 SHORT → TIMER MODE: toggle ON/OFF
               ---------------------------------------------------- */
            case BTN_UP:
                if (timerActive)
                {
                    ModelHandle_StopTimer();
                }
                else
                {
                    ModelHandle_StartTimer();
                }
                ui = UI_TIMER;
                screenNeedsRefresh = true;
                return;

            /* ----------------------------------------------------
               SW3 LONG → Semi-auto toggle
               ---------------------------------------------------- */
            case BTN_UP_LONG:
                if (semiAutoActive)
                    ModelHandle_StopSemiAuto();
                else
                    ModelHandle_StartSemiAuto();

