Amiya200/stm32_water_tank/Core/Src/screen.c
                ui = UI_SEMI_AUTO;
                screenNeedsRefresh = true;
                return;


            /* ====================================================
               COUNTDOWN MODE BEHAVIOR (your requirement)
               ==================================================== */

            /* ----------------------------------------------------
               SW4 SHORT:
               - If OFF → start 1-minute countdown
               - If ON  → stop countdown
               ---------------------------------------------------- */
            case BTN_DOWN:
                if (!countdownActive)
                {
                    edit_countdown_min = 1;  // default 1 minute
                    ModelHandle_StartCountdown(1 * 60UL);
                }
                else
                {
                    ModelHandle_StopCountdown();
                }

                ui = UI_COUNTDOWN;
                screenNeedsRefresh = true;
                return;

            /* ----------------------------------------------------
               SW4 LONG:
               - Increase countdown minutes every 1 second
               ---------------------------------------------------- */
            case BTN_DOWN_LONG:
            {
                ui = UI_COUNTDOWN_EDIT_MIN;

                static uint32_t lastInc = 0;
                uint32_t now = HAL_GetTick();

                if (now - lastInc >= 1000)  // 1 second repeat
                {
                    lastInc = now;

                    edit_countdown_min++;
                    if (edit_countdown_min > 999)
                        edit_countdown_min = 999;

                    ModelHandle_StartCountdown(edit_countdown_min * 60UL);
                    screenNeedsRefresh = true;
                }
                return;
            }

            default:
                break;
        }
    }


    /* ============================================================
       INSIDE MENU — Navigation and Edit
       ============================================================ */
    switch(b)
    {
        case BTN_RESET:
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_SELECT:
            menu_select();
            return;

        case BTN_UP:
            if (ui == UI_MENU)
            {
                if (menu_idx > 0) menu_idx--;
            }
            else
            {
                increase_edit_value();
            }
            screenNeedsRefresh = true;
            return;

        case BTN_UP_LONG:
            if (HAL_GetTick() - last_repeat_time > CONTINUOUS_STEP_MS)
            {
                last_repeat_time = HAL_GetTick();
                increase_edit_value();
                screenNeedsRefresh = true;
            }
            return;

        case BTN_DOWN:
            if (ui == UI_MENU)
            {
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
            }
            else
            {
                decrease_edit_value();
            }
            screenNeedsRefresh = true;
            return;

        case BTN_DOWN_LONG:
            if (HAL_GetTick() - last_repeat_time > CONTINUOUS_STEP_MS)
            {
                last_repeat_time = HAL_GetTick();
                decrease_edit_value();
                screenNeedsRefresh = true;
            }
            return;

        default:
            return;
    }
}

/* ================================================================
   LCD UPDATE ENGINE
   ================================================================ */

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    /* Cursor blink active in edit screens */
    bool cursorBlinkActive =
        (ui == UI_MENU ||
         ui == UI_TIMER_EDIT_SLOT_ON_H ||
         ui == UI_TIMER_EDIT_SLOT_ON_M ||
         ui == UI_TIMER_EDIT_SLOT_OFF_H ||
         ui == UI_TIMER_EDIT_SLOT_OFF_M ||
         ui == UI_COUNTDOWN_EDIT_MIN ||
         ui == UI_TWIST_EDIT_ON ||
         ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H ||
         ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H ||
         ui == UI_TWIST_EDIT_OFF_M ||
         ui == UI_AUTO_EDIT_GAP ||
         ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY);

    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS)){
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        screenNeedsRefresh = true;
    }

    /* Welcome → Dashboard */
    if (ui == UI_WELCOME && now - lastLcdUpdateTime >= WELCOME_MS){
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* Auto return after inactivity */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        now - lastUserAction >= AUTO_BACK_MS){
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Dashboard refresh every 1 sec */
    if (ui == UI_DASH && now - lastLcdUpdateTime >= 1000){
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* Perform LCD refresh */
    if (screenNeedsRefresh || ui != last_ui){
        bool fullRefresh = (ui != last_ui);
        last_ui = ui;
        screenNeedsRefresh = false;

        if (fullRefresh)
            lcd_clear();

        switch(ui){
            case UI_WELCOME:                show_welcome(); break;
            case UI_DASH:                   show_dash(); break;

            case UI_MENU:                   show_menu(); break;

            case UI_MANUAL:                 show_manual(); break;
            case UI_SEMI_AUTO:              show_semi_auto(); break;

            case UI_TIMER:                  show_timer(); break;
            case UI_TIMER_EDIT_SLOT_ON_H:   show_timer_on_h(); break;
            case UI_TIMER_EDIT_SLOT_ON_M:   show_timer_on_m(); break;
            case UI_TIMER_EDIT_SLOT_OFF_H:  show_timer_off_h(); break;
            case UI_TIMER_EDIT_SLOT_OFF_M:  show_timer_off_m(); break;

            case UI_AUTO_MENU:              show_auto_menu(); break;
            case UI_AUTO_EDIT_GAP:          show_auto_gap(); break;
            case UI_AUTO_EDIT_MAXRUN:       show_auto_maxrun(); break;
            case UI_AUTO_EDIT_RETRY:        show_auto_retry(); break;

            case UI_COUNTDOWN:              show_countdown(); break;
            case UI_COUNTDOWN_EDIT_MIN:     show_countdown_edit_min(); break;

            case UI_TWIST:                  show_twist(); break;
            case UI_TWIST_EDIT_ON:          show_twist_on_sec(); break;
            case UI_TWIST_EDIT_OFF:         show_twist_off_sec(); break;
            case UI_TWIST_EDIT_ON_H:        show_twist_on_h(); break;
            case UI_TWIST_EDIT_ON_M:        show_twist_on_m(); break;
            case UI_TWIST_EDIT_OFF_H:       show_twist_off_h(); break;
            case UI_TWIST_EDIT_OFF_M:       show_twist_off_m(); break;

            default:
                lcd_line0("Not Impl");
                lcd_line1(" ");
                break;
        }
    }
}

/***************************************************************
 *  END OF FINAL SCREEN.C (COMPLETE FILE)
 ***************************************************************/
